[
  { "text": "Code is like humor. When you have to explain it, it’s bad.", "author": "Cory House" },
  { "text": "Programs must be written for people to read, and only incidentally for machines to execute.", "author": "Harold Abelson" },
  { "text": "Simplicity is the soul of efficiency.", "author": "Austin Freeman" },
  { "text": "First, solve the problem. Then, write the code.", "author": "John Johnson" },
  { "text": "Experience is the name everyone gives to their mistakes.", "author": "Oscar Wilde" },
  { "text": "Before software can be reusable it first has to be usable.", "author": "Ralph Johnson" },
  { "text": "Java is to JavaScript what car is to Carpet.", "author": "Chris Heilmann" },
  { "text": "Knowledge is power.", "author": "Francis Bacon" },
  { "text": "Sometimes it pays to stay in bed on Monday, rather than spending the rest of the week debugging Monday’s code.", "author": "Dan Salomon" },
  { "text": "Fix the cause, not the symptom.", "author": "Steve Maguire" },
  { "text": "Optimism is an occupational hazard of programming: feedback is the treatment.", "author": "Kent Beck" },
  { "text": "When to use iterative development? You should use iterative development only on projects that you want to succeed.", "author": "Martin Fowler" },
  { "text": "Simplicity is the prerequisite for reliability.", "author": "Edsger Dijkstra" },
  { "text": "Any fool can write code that a computer can understand. Good programmers write code that humans can understand.", "author": "Martin Fowler" },
  { "text": "Sometimes it’s better to leave something alone, to pause, and that’s very true of programming.", "author": "Joyce Wheeler" },
  { "text": "Programming isn’t about what you know; it’s about what you can figure out.", "author": "Chris Pine" },
  { "text": "The most disastrous thing that you can ever learn is your first programming language.", "author": "Alan Kay" },
  { "text": "The best error message is the one that never shows up.", "author": "Thomas Fuchs" },
  { "text": "The function of good software is to make the complex appear simple.", "author": "Grady Booch" },
  { "text": "Walking on water and developing software from a specification are easy if both are frozen.", "author": "Edward V. Berard" },
  { "text": "It’s not a bug – it’s an undocumented feature.", "author": "Anonymous" },
  { "text": "One man’s crappy software is another man’s full-time job.", "author": "Jessica Gaston" },
  { "text": "There are only two kinds of programming languages: those people always bitch about and those nobody uses.", "author": "Bjarne Stroustrup" },
  { "text": "The best thing about a boolean is even if you are wrong, you are only off by a bit.", "author": "Anonymous" },
  { "text": "In theory, theory and practice are the same. In practice, they’re not.", "author": "Yogi Berra" },
  { "text": "Good code is its own best documentation.", "author": "Steve McConnell" },
  { "text": "Deleted code is debugged code.", "author": "Jeff Sickel" },
  { "text": "There are 10 kinds of people in this world: those who understand binary and those who don’t.", "author": "Anonymous" },
  { "text": "The best way to get a project done faster is to start sooner.", "author": "Jim Highsmith" },
  { "text": "Programming is the art of telling another human what one wants the computer to do.", "author": "Donald Knuth" },
  { "text": "Software is a great combination of artistry and engineering.", "author": "Bill Gates" },
  { "text": "The computer was born to solve problems that did not exist before.", "author": "Bill Gates" },
  { "text": "You might not think that programmers are artists, but programming is an extremely creative profession. It’s logic-based creativity.", "author": "John Romero" },
  { "text": "The cheapest, fastest, and most reliable components of a computer system are those that aren’t there.", "author": "Gordon Bell" },
  { "text": "There is no programming language—no matter how structured—that will prevent programmers from making bad programs.", "author": "Larry Flon" },
  { "text": "It’s hardware that makes a machine fast. It’s software that makes a fast machine slow.", "author": "Craig Bruce" },
  { "text": "The purpose of software engineering is to control complexity, not to create it.", "author": "Pamela Zave" },
  { "text": "Programming can be fun, so can cryptography; however they should not be combined.", "author": "Kreitzberg and Shneiderman" },
  { "text": "If you automate a mess, you get an automated mess.", "author": "Rod Michael" },
  { "text": "The best performance improvement is the transition from the nonworking state to the working state.", "author": "J. Osterhout" },
  { "text": "Every good work of software starts by scratching a developer’s personal itch.", "author": "Eric S. Raymond" },
  { "text": "In programming, the hard part isn’t solving problems, but deciding what problems to solve.", "author": "Paul Graham" },
  { "text": "To iterate is human, to recurse divine.", "author": "L. Peter Deutsch" },
  { "text": "The most important property of a program is whether it accomplishes the intention of its user.", "author": "C.A.R. Hoare" },
  { "text": "Premature optimization is the root of all evil.", "author": "Donald Knuth" },
  { "text": "Debugging is like being the detective in a crime movie where you are also the murderer.", "author": "Felipe Fortes" },
  { "text": "A language that doesn’t affect the way you think about programming is not worth knowing.", "author": "Alan Perlis" },
  { "text": "Measuring programming progress by lines of code is like measuring aircraft building progress by weight.", "author": "Bill Gates" },
  { "text": "Programming is not easy like Sunday morning, it’s very hard like Monday morning.", "author": "Anonymous" }
]

